In [ ]:
#задание 1
"""Скачайте датасет любого размера.Определите какому фильму было выставлено больше всего оценок 5.0"""

In [1]:
import pandas as pd

In [5]:
data = pd.read_csv('ratings.csv')
data.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [21]:
best_films = data[data.rating==5.0]
best_films.head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [33]:
a=best_films['movieId'].value_counts().head(1)
print(f'best movieId = {a}')

best movieId = 318    153
Name: movieId, dtype: int64

In [ ]:
# задание 2
"""По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) 
категорий 4, 12 и 21 за период с 2005 по 2010 годы. Не учитывайте в расчетах отрицательные значения quantity"""

In [10]:
data_2 = pd.read_csv('power.csv')
data_2.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [36]:
filtered_countries = data_2[ (data_2['country']=='Latvia') | (data_2['country']=='Lithuania') | (data_2['country']=='Estonia')]
filtered_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [54]:
filtered_countries_by_category = filtered_countries[ (filtered_countries['category']==4) | (filtered_countries['category']==12) | (filtered_countries['category']==21)]

In [53]:
filtered_countries_by_year = filtered_countries_by_category[(filtered_countries_by_category['year']==2005) | (filtered_countries_by_category['year']==2006) 
| (filtered_countries_by_category['year']==2007) | (filtered_countries_by_category['year']==2008) | (filtered_countries_by_category['year']==2009) | (filtered_countries_by_category['year']==2010)]
filtered_countries_by_year.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [61]:
filtered_quantity = filtered_countries_by_year[filtered_countries_by_year.quantity>=0]
print(filtered_quantity.groupby(['country'])['category'].count())

country
Estonia       99
Latvia        92
Lithuania    217
Name: category, dtype: int64

In [ ]:
# задание 3 
"""Выберите страницу любого сайта с табличными данными, импортируйте таблицы в pandas dataframe."""

In [7]:
pd.read_html('https://www.banki.ru/products/creditcards/')[0]

,"Название, банк",Ставка,"Кредитный лимит, ₽",Unnamed: 3
0,120подНОЛЬ Росбанк,"от 21,4%",до 1 000 000,Онлайн - заявка 6 113 заявок
1,Card Credit Plus Кредит Европа Банк,от 0%,до 600 000,Онлайн - заявка 4 824 заявки
2,Просто 30 Восточный Банк,20%,до 120 000,Онлайн - заявка 1 665 заявок
3,Всё сразу Райффайзенбанк,от 29%,до 600 000,Онлайн - заявка 972 заявки